# GIT - распределенная система конроля версий.
# это система для отслеживания и ведения истории изменения файлом в вашем проекте.

# Репозиторий - это хранилище вашего кода и истории его изменений.

# GitHub - это вебсайт для размещения git-репозиториев и  совместной разработки проектов.


# Команды Git 
# 1. git init - она создает новый гит репозиторий локальный на вашем пк

# 2. git commit - как только мы достигаем определенного момента в разработке, то тогда мы сохраняем и комментируем изменения.(фиксация изменений в репозитории)
# git commit -m '<comment>'

# 3. git add - когда, мы создаем или изменяем файлы, то при помощи этой команды мы загружаем все изменения в локальное хранилище(репозиторий)

# git add <название файла>
# git add . (все что находится внутри)


# 4. git remote add - это команда для того , что бы связать ваш проект с удаленным репозиторием(репозиторий в гитхаб)

# git remote add <название подключения> <ссылка на репозиторий>
# git remote add origin <url>


# 5. git push - после коммита изменений при помощи этой команды мы отправляем наши изменения на удаленный репозиторий

# git push <назваание ветки>

