1



# pwd (present working directory) вывод путь до ближайшей директории (папки)
# mkdir (make directory) создает указанную директорию (папку)
# rmdir (remove directory) удаляет указанную директорию (папку) 
# /-символ корневой директории
# ~-символ домашней директории 
# ..-обозначают предыдущую директорию
# .-обозначает текущую директорию
# ctrl+s сохранить 
# rm -rf принудительное удаление
# rm - удвлениие файлов
# ls -a - вывод список как скрытых так и обычных директорий и файлов
# nano <path_to_file> открывает графический интерфейс для редактирования файлов,если нет то создатся файл с таким названием
# cat <path_to_file> - выводит содержимое файла

